{
    "standard": "PCI DSS",
    "version": "4.0",
    "description": "Payment Card Industry Data Security Standard Compliance Template",
    "requirements": [
        {
            "requirement_id": "1",
            "title": "Install and Maintain Network Security Controls",
            "description": "Network security controls (NSWs) are implemented for managed interfaces to protect the CDE from unauthorized traffic and to manage all other traffic.",
            "testing_procedures": [
                "1.1 Verify that all network security controls are identified and documented.",
                "1.2 Verify that network security controls are implemented and maintained.",
                "1.3 Verify that all traffic is allowed only from trusted sources and to known destinations."
            ],
            "guidance": "Network security controls should be implemented to protect the CDE from unauthorized traffic and to manage all other traffic.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "2",
            "title": "Apply Secure Configurations to All System Components",
            "description": "Systems are configured securely to prevent misuse.",
            "testing_procedures": [
                "2.1 Verify that vendor default accounts are managed securely.",
                "2.2 Verify that system components are configured securely.",
                "2.3 Verify that unnecessary functionality is removed or disabled."
            ],
            "guidance": "Secure configurations should be applied to all system components to prevent misuse.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "3",
            "title": "Protect Stored Account Data",
            "description": "Sensitive authentication data (SAD) is not stored after authorization (even if encrypted).",
            "testing_procedures": [
                "3.1 Verify that SAD is not stored after authorization.",
                "3.2 Verify that PAN is masked when displayed.",
                "3.3 Verify that cryptographic keys used to protect stored account data are managed securely."
            ],
            "guidance": "Sensitive authentication data should not be stored after authorization, and PAN should be masked when displayed.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": true
        },
        {
            "requirement_id": "4",
            "title": "Protect Cardholder Data with Strong Cryptography During Transmission Over Open, Public Networks",
            "description": "Strong cryptography and security protocols are used to safeguard sensitive cardholder data during transmission over open, public networks.",
            "testing_procedures": [
                "4.1 Verify that strong cryptography and security protocols are used to protect cardholder data during transmission.",
                "4.2 Verify that security policies and operational procedures for encrypting transmissions of cardholder data are documented and in use."
            ],
            "guidance": "Strong cryptography and security protocols should be used to protect cardholder data during transmission over open, public networks.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": true
        },
        {
            "requirement_id": "5",
            "title": "Protect All Systems and Networks from Malicious Software",
            "description": "Malware is prevented, or detected and addressed.",
            "testing_procedures": [
                "5.1 Verify that anti-virus software is deployed on all systems commonly affected by malicious software.",
                "5.2 Verify that anti-virus mechanisms are actively running and cannot be disabled or altered by users.",
                "5.3 Verify that security policies and operational procedures for protecting systems against malware are documented and in use."
            ],
            "guidance": "Anti-virus software should be deployed on all systems commonly affected by malicious software.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "6",
            "title": "Develop and Maintain Secure Systems and Software",
            "description": "Systems and software are protected from known vulnerabilities by having the latest vendor-supplied security patches installed.",
            "testing_procedures": [
                "6.1 Verify that all system components and software are protected from known vulnerabilities by having the latest vendor-supplied security patches installed.",
                "6.2 Verify that software development processes align with industry standards and best practices.",
                "6.3 Verify that security policies and operational procedures for developing and maintaining secure systems and software are documented and in use."
            ],
            "guidance": "Systems and software should be protected from known vulnerabilities by having the latest vendor-supplied security patches installed.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "7",
            "title": "Restrict Access to System Components and Cardholder Data by Business Need to Know",
            "description": "Access to system components and data is appropriately defined and assigned based on business and security requirements.",
            "testing_procedures": [
                "7.1 Verify that access to system components and data is appropriately defined and assigned based on business and security requirements.",
                "7.2 Verify that access to system components and data is restricted to only those individuals whose job requires such access.",
                "7.3 Verify that security policies and operational procedures for restricting access to system components and cardholder data are documented and in use."
            ],
            "guidance": "Access to system components and data should be appropriately defined and assigned based on business and security requirements.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "8",
            "title": "Identify Users and Authenticate Access to System Components",
            "description": "Users are identified and authenticated when accessing system components.",
            "testing_procedures": [
                "8.1 Verify that all users are identified and authenticated when accessing system components.",
                "8.2 Verify that multi-factor authentication is implemented for all access into the CDE.",
                "8.3 Verify that security policies and operational procedures for identifying and authenticating users are documented and in use."
            ],
            "guidance": "Users should be identified and authenticated when accessing system components, and multi-factor authentication should be implemented for all access into the CDE.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "9",
            "title": "Restrict Physical Access to Cardholder Data",
            "description": "Physical access to cardholder data is appropriately restricted.",
            "testing_procedures": [
                "9.1 Verify that physical access to cardholder data is appropriately restricted.",
                "9.2 Verify that physical access to sensitive areas is controlled and monitored.",
                "9.3 Verify that security policies and operational procedures for restricting physical access to cardholder data are documented and in use."
            ],
            "guidance": "Physical access to cardholder data should be appropriately restricted, and physical access to sensitive areas should be controlled and monitored.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "10",
            "title": "Log and Monitor All Access to System Components and Cardholder Data",
            "description": "Logs of all access to system components and cardholder data are maintained and reviewed.",
            "testing_procedures": [
                "10.1 Verify that logs of all access to system components and cardholder data are maintained.",
                "10.2 Verify that logs are reviewed regularly to identify anomalies or suspicious activity.",
                "10.3 Verify that security policies and operational procedures for logging and monitoring access to system components and cardholder data are documented and in use."
            ],
            "guidance": "Logs of all access to system components and cardholder data should be maintained and reviewed regularly to identify anomalies or suspicious activity.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "11",
            "title": "Test Security of Systems and Networks Regularly",
            "description": "Security systems and processes are regularly tested to ensure they are functioning as intended.",
            "testing_procedures": [
                "11.1 Verify that security systems and processes are regularly tested to ensure they are functioning as intended.",
                "11.2 Verify that internal and external vulnerability scans are performed regularly.",
                "11.3 Verify that security policies and operational procedures for testing security of systems and networks are documented and in use."
            ],
            "guidance": "Security systems and processes should be regularly tested to ensure they are functioning as intended, and internal and external vulnerability scans should be performed regularly.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        },
        {
            "requirement_id": "12",
            "title": "Support Information Security with Organizational Policies and Programs",
            "description": "Policies and programs support information security across the organization.",
            "testing_procedures": [
                "12.1 Verify that information security policies are established, published, maintained, and disseminated to all relevant personnel.",
                "12.2 Verify that a formal security awareness program is implemented to make all personnel aware of the importance of cardholder data security.",
                "12.3 Verify that security policies and operational procedures for supporting information security are documented and in use."
            ],
            "guidance": "Information security policies should be established, published, maintained, and disseminated to all relevant personnel, and a formal security awareness program should be implemented.",
            "entity_responsibility": ["Merchant", "Service Provider"],
            "customized_approach": false
        }
    ],
    "reporting_requirements": {
        "quarterly_vulnerability_scans": {
            "internal": {
                "performed_by": "qualified_personnel",
                "frequency": "quarterly",
                "remediation_verification": "required"
            },
            "external": {
                "performed_by": "approved_scan_vendor",
                "frequency": "quarterly",
                "attestation_scan": "required"
            }
        },
        "penetration_testing": {
            "internal": {
                "frequency": "annually",
                "after_significant_changes": true
            },
            "external": {
                "frequency": "annually",
                "after_significant_changes": true
            },
            "segmentation_checks": {
                "frequency": "every_6_months",
                "methodology": "manual_or_automated"
            }
        },
        "compliance_reports": {
            "roc_saq": {
                "roc": "for_service_providers",
                "saq_type": ["a", "a_ep", "b", "b_ip", "c_vt", "c", "p2pe", "d_service_provider", "d_merchant"],
                "submission": "annually_to_acquiring_bank"
            },
            "attestation_of_compliance": {
                "completion_required": true,
                "signed_by": "officer_of_organization"
            }
        },
        "incident_response": {
            "immediate_action": "contain_and_mitigate",
            "notification": {
                "payment_brands": "immediately",
                "law_enforcement": "if_required",
                "affected_parties": "as_required"
            },
            "forensic_investigation": {
                "required": "for_confirmed_breach",
                "performed_by": "approved_forensic_investigator"
            }
        },
        "documentation_retention": {
            "policies_procedures": "at_least_one_year",
            "audit_logs": "at_least_one_year",
            "scan_reports": "at_least_one_year",
            "aoc_roc": "at_least_three_years"
        }
    },
    "audit_checks": [
        {
            "id": "PCI-AUDIT-001",
            "description": "Network Security Controls",
            "verification_points": [
                "firewall_configuration_reviewed",
                "network_segmentation_verified",
                "default_passwords_changed"
            ]
        },
        {
            "id": "PCI-AUDIT-002",
            "description": "Cardholder Data Protection",
            "verification_points": [
                "pan_storage_verified",
                "encryption_standards_met",
                "key_management_reviewed"
            ]
        },
        {
            "id": "PCI-AUDIT-003",
            "description": "Vulnerability Management",
            "verification_points": [
                "patch_management_process",
                "malware_protection_implemented",
                "secure_configuration_standards"
            ]
        },
        {
            "id": "PCI-AUDIT-004",
            "description": "Access Control Measures",
            "verification_points": [
                "unique_id_implementation",
                "physical_access_controls",
                "access_review_process"
            ]
        },
        {
            "id": "PCI-AUDIT-005",
            "description": "Monitoring and Testing",
            "verification_points": [
                "log_management_review",
                "intrusion_detection_configuration",
                "penetration_testing_results"
            ]
        },
        {
            "id": "PCI-AUDIT-006",
            "description": "Security Policies",
            "verification_points": [
                "policy_documentation_review",
                "employee_awareness_program",
                "incident_response_plan"
            ]
        }
    ]
}
